# 1.) Cutlets Problem

In [4]:
import pandas as pd
import numpy as np
from scipy import stats

In [6]:
cutlet_df=pd.read_csv('C:\\Users\\Mani\\Desktop\\Excelr\\Assignments\\Hypothesis_Testing\\Cutlets.csv')
cutlet_df.head()

   Unit A  Unit B
0  6.8090  6.7703
1  6.4376  7.5093
2  6.9157  6.7300
3  7.3012  6.7878
4  7.4488  7.1522

In [15]:
cutlet_df=cutlet_df.rename({'Unit A': 'UnitA','Unit B':'UnitB'},axis=1)
cutlet_df.head()

    UnitA   UnitB
0  6.8090  6.7703
1  6.4376  7.5093
2  6.9157  6.7300
3  7.3012  6.7878
4  7.4488  7.1522

In [16]:
mean_A=np.mean(cutlet_df.UnitA)

In [17]:
mean_B=np.mean(cutlet_df.UnitB)

In [18]:
mean_A-mean_B

0.054794285714288016

In [14]:
stats.ttest_ind(cutlet_df.UnitA,cutlet_df.UnitB)

Ttest_indResult(statistic=0.7228688704678063, pvalue=0.4722394724599501)

# 2.)Turn Around Time

In [21]:
tat_df=pd.read_csv('C:\\Users\\Mani\\Desktop\\Excelr\\Assignments\\Hypothesis_Testing\\LabTAT.csv')
tat_df

     Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0          185.35        165.53        176.70        166.13
1          170.49        185.91        198.45        160.79
2          192.77        194.92        201.23        185.18
3          177.33        183.00        199.61        176.42
4          193.41        169.57        204.63        152.60
..            ...           ...           ...           ...
115        178.49        170.66        193.80        172.68
116        176.08        183.98        215.25        177.64
117        202.48        174.54        203.99        170.27
118        182.40        197.18        194.52        150.87
119        182.09        215.17        221.49        162.21

[120 rows x 4 columns]